


about_bot_text = """
Что может делать этот бот?

Данный бот создан для участников сообщества “ASTERI CLUB”, чтобы дать им больше возможностей по заработку и приумножению своего капитала. 

С помощью этого бота вы сможете:
— начать обучаться заработку на инвестициях и трейдинге; 
— зарабатывать на продвижение сообщества (активные партнеры зарабатывают более 100 000 рублей в месяц);
— использовать доходные инструменты сообщества, которые дают хорошую прибыль; 
— получать бонусы и подарки.

Ко всему этому вы получите доступ к нашему инвест-сообществу с большим количеством полезной информации

Жмите кнопку НАЧАТЬ и присоединяйся к нашему сообществу
    """


user_agreement_text = """
🔰 Ознакомьтесь и примите соглашение

<a href="https://www.google.com">Пользовательское соглашение</a>
"""

send_number_text = """
📲 Отправьте номер телефона - нажав кнопку ниже
"""

about_your_country_text = """
✏ Укажите с какого вы города (страны)
"""

hello_text = """
<b>Мы рады тебя видеть в сообществе «ASTERI CLUB», {}</b>

Тебя ждет много интересного. Мы развиваем финансовую грамотность и инвестирование через новое окружение, вечеринки, личностное и духовное развитие.

<b>❗ Пользуясь этим ботом ты становишься участником нашего сообщества и ты можешь:</b>

✅ посещать мероприятия от наших экспертов, которые мы проводим в чате нашего сообщества <b><a href="https://t.me/+LGV1n-IBFPZiNWMy">👉 ПЕРЕЙТИ В ЧАТ</a></b>

✅ пользоваться INVEST-копилкой с доходность до 40% годовых

✅ зарабатывать с рекомендации сообщества, получая до 30% от стоимости услуг, которые оплатят твои рефералы

✅ участвовать в промоушенах, розыгрышах и получать за это классные бонусы.

<b>🎁 Так же для всех новых участников мы приготовили ПОДАРКИ:</b>
    ● доступ к обучению по финансовой грамотности и инвестированию <b><a href="https://stepik.org/course/175367">👉 ПОЛУЧИТЬ</a></b>
    ● ТОП-10 перспективных токенов и акций <b><a href="https://disk.yandex.ru/d/N_e8EpL_ETQgnw">👉 ПОЛУЧИТЬ</a></b>

"""


wallet_text = """

БАЛАНС КОШЕЛЬКА - {} AS
ВСЕГО ЗАРАБОТАНО - {} AS
---
💰КОПИЛКА: 
▫️Баланс - {} AS
▫️Всего начислено - {} AS

⚖️ ПАРТНЕРСКАЯ ПРОГРАММА: 
▫️ Заработано - {} AS
▫️ Статус - {} 

ℹ️ ИНФОРМАЦИЯ:
▫️Ваш ID - {}
▫️Вы с нами - {}
▫️Ваш пакет - "ASTERI {}"
▫️Ваша реферальная ссылка {}

"""


by_packet_text = """
Выберете AS-пакет, который вы хотите приобрести:
"""


lite_by_plan = """
Пакет «ASTERI LITE» включает в себя:

▪️ пожизненный доступ к закрытому чату;
▪ продвинутый курс по финансовой грамотности и базовым инвестициям; 
▪ вебинары с разбором заданий по обучению и ответами на вопросы;
▪ ️доступ к копитрейдингу с ожидаемой доходностью 5-20% в месяц;
▪️ 2-уровневая партнерская программа;
▪️ установка и ведение торгового бота с ожидаемой доходностью до 30% в год;
 ▪ информация о бесплатных раздачах монет, тестах сетей и тд;
▪ специальные условия на услуги и товары наших партнеров.

💰СТОИМОСТЬ: {} AS
(Возможна оплата в рассрочку от {} рублей в месяц)
"""

pro_by_plan = """
Пакет «ASTERI PRO» включает в себя:

▪️ все условия с пакета «LITE»
▪ курс по инвестированию с готовой стратегией; 
▪ кураторы, которые могут ответить на любой вопрос;
▪ ️доступ к инвестиционным пулам; 
▪️ 3-уровневая партнерская программа;
▪️ установка и ведение торгового бота с ожидаемой доходностью до 45% в год;
▪ формирование инвестиционного портфеля;
▪ торговые сигналы с потенциальной доходностью до 15% в месяц.

💰СТОИМОСТЬ: {} AS
(Возможна оплата в рассрочку от {} рублей в месяц)
"""

vip_by_plan = """
Пакет «ASTERI VIP» включает в себя:

▪️ все условия с пакета «LITE» и «PRO»
▪ курс по трейдингу с готовой стратегией; 
▪  личные встречи/вебинары с основателем и экспертами сообщества;
▪ предоставление вариантов по 
альтернативным инвестициям; 
▪️ 5-уровневая партнерская программа;
▪️ установка и ведение торгового бота с ожидаемой доходностью до 60% в год;
▪ закрытые встречи и вечерики;
▪ торговые сигналы с потенциальной доходностью до 40% в месяц.

💰СТОИМОСТЬ: {} AS
(Возможна оплата в рассрочку от {} рублей в месяц)
"""


by_variant_packet_text = """
Вы уверено, что хотите приобрести пакет «{}»? С вашего баланса будет списано {} AS
"""

confirm_by_packet_success_text = """
Поздравляем вас с приобретением пакета «{}» 🥳

Добавляйтесь в закрытый чат <b><a href="{}">👉 ПЕРЕЙТИ</a></b>
"""

confirm_by_packet_error_text = """
На вашем балансе не достаточно AS для оплаты пакета. Пополните баланс и после повторите операцию.
"""

installment_rub_text = """
Не ждите и оформите рассрочку, чтобы получить доступ к сообществу и доходным инструментами уже сегодня.
 
Рассрочку оформляется без переплаты. Все расходы по процентам мы берем на себя. 

Выберите условия на который вы бы хотели оформить рассрочку. Если условия для вас не подходят или у вас есть вопросы, то свяжитесь с нами через SUPPORT

1 AS = {} РУБЛЕЙ
"""

write_add_money_text = """
Укажите количество AS , которую хотите пополнить. Минимальная сумма пополнения 10 AS. 

1 AS = 1 USDT
"""

add_money_commit_text = """
Вы можете оплатить в любой удобной вам криптовалютой указанную вам сумму

🔴 Внимание! При отправке отдельно учитывайте комиссию вашего кошелька или биржи
🔴 Внимание! Платеж будет отклонен через 30 мин, если он не будет оплачен
"""

write_leave_money_text = """
Укажите количество AS, которое хотите вывести. .

Минимальная сумма вывода: 50 AS. Комиссия за вывод составляет 3,5%

Вывод доступен только в USDT в сети BSC (BEP-20)

1 AS = 1 USDT
"""

leave_money_wallet_error_text = """
❌ Не корректно введенная сума вывода
"""


write_wallet_text = """
Введите адрес USDT в сети BSC (BEP-20) на который вы хотите совершить вывод
"""

write_wallet_commit_error_wallet = """
❌ Не верно указанный адрес кошелька BSC (BEP-20)
"""


write_wallet_commit_cancel = """
❌ Процесс вывода средств отменен
"""

leave_money_commit_text = """
✏ Минимальная сумма вывода - 50 AS, на вашем балансе должно быть хотя-бы 50 AS
"""

leave_money_true_text = """
✅ Ваша заявка принята. Максимальный срок рассмотрения заявки - 72 часа
"""

leave_money_not_balance_text = """
Недостаточно AS на кошельке. Если у вас возникли вопросы, то свяжитесь с нами.
"""

information_text = """
ℹ В этом разделе вы сможете найти информацию про сообщество и весь необходимый материал для более глубокого погружения в мир «ASTERI CLUB».

❗ Так же данный материал можете использовать для продвижения сообщества.
"""

presentation_text = """
Asteri Club - это образовательное инвест-сообщество, которое было основано в 2021 года  Александром Здановичем. 

В основе сообщества лежит 3 составляющих: 

▪️ Деньги

▪️ Эмоции

▪️ Окружение

С помощью “Asteri Club” вы можете повысить свой доход, получить новые знания, обрести успешное окружение и получить много приятных эмоций. 

Более подробно познакомиться с сообществом вы можете через видео-презентацию  <b><a href="https://youtu.be/4zRB786Fd4E?si=Uithr95wHHNs2Pvg">👉 СМОТРЕТЬ ВИДЕО</a></b>

❗Так же выше прикрепленна PDF-презентация, которой вы можете поделиться со своми друзьями.
"""

urls_chats_text = """
✅ Общий telegram-чат <b><a href="https://t.me/+LGV1n-IBFPZiNWMy">👉 ПЕРЕЙТИ</a></b>

✅ Telegram-канал <b><a href="https://t.me/+YnO5ZztkxXAyMTEy">👉 ПЕРЕЙТИ</a></b>

✅ Instagram <b><a href="https://www.instagram.com/asteri.club">👉 ПЕРЕЙТИ</a></b>

✅ YouTube <b><a href="https://www.youtube.com/@astericlub/">👉 ПЕРЕЙТИ</a></b>

✅ VK <b><a href="https://vk.com/astericlub">👉 ПЕРЕЙТИ</a></b>

🔴 Для пакетов “LITE”, “PRO” и “VIP” существуют закрытые чаты. В них находиться информация про обучение, торговые сигналы, роботы, пулы и тд. Если вдруг вы купили пакет и у вас нет доступа в закрытый чат, то обратитесь в @AsteriSupport.
"""

advance_text = """
💸 В нашем сообществе есть возможность зарабатывать с рекомендации сообщества. Активные партнеры зарабатывают более 100 000 рублей в месяц. Для эффективной работы нужно пройти базовое обучение  👉 СМОТРЕТЬ ВИДЕО ПРО ПРОДВИЖЕНИЕ

❗Так же ниже вы можете ознакомиться получить шаблоны для продвижения в соц.сетях
"""


partner_program_text = """
▫ Статус: {}
▫ Всего заработано - {} AS
---
⚖️  Вы можете зарабатывать с продвижения сообщества. Активные партнеры зарабатывают более 100 000 рублей в месяц. Более подробно  об условиях партнерской программы можно ознакомиться в PDF-презентации.

🚀 КОЛИЧЕСТВО РЕКОМЕНДАЦИЙ: 
1 уровень (10%) - {} участников 
2 уровень (5%) - {} участников 
3 уровень (5%) - {} участников 
4 уровень (5%) - {} участников 
5 уровень (5%) - {} участников 

ℹ️ ИНФОРМАЦИЯ: 
▪ активировано: {}
▪ оборот первой линии - {} AS
▪ общий оборот: {} AS
▪ ваш наставник: {}
▪ ваша реферальная ссылка: {}
"""

bank_text = """
БАЛАНС КОПИЛКИ - {} AS
В ОЖИДАНИИ - {} AS
ВСЕГО ЗАРАБОТАНО - {} AS

💰 Копилка - это инструмент, который позволяет быстрее реализовывать финансовые цели за счет общего инвестиционного пула, который работает по специальной стратегии. Вы можете ежемесячно откладывать по 5-10% от своего дохода, чтобы накопить достаточную сумму для будущих покупок или для любых других целей. Начать можно всего с 10 USDT.

В чем ваша выгода?
1. Вам не нужно анализировать рынок
2. Вам не нужно управлять торговыми ботами
3. Ожидаемая доходность: 20-60% в год

❗️Важно. Средства, которые вы внесёте начнут работать с понедельника. Отчёт начинается в понедельник 00:00 по МСК (переход с воскресенье на понедельник). Таким образом выгодно пополнять копилку в конце недели. Вывести средства с копилки на свой кошелёк вы можете в любое время, срок перевода средств с копилки на кошелёк в боте - до 14 дней. Комиссии нет.

🔴 Более подробно про работу копилки <b><a href="https://youtu.be/6-zIjC474-I?si=J741F6WjDDvJST7n">👉 СМОТРЕТЬ ВИДЕО</a></b>
"""

bank_add_text = """
✏ Укажите количество AS , которую хотите направить в копилку. Минимальная сумма пополнения 10 AS.
"""

bank_add_true_text = """
Вы уверено, что хотите пополнить копилку на {} AS?
"""

bank_add_commit_text = """
Поздравляем 🥳 Ваша копилка пополнена на {} AS
"""

add_bank_not_balance_text = """
На вашем балансе не достаточно AS для оплаты пакета. Пополните баланс и после повторите операцию.
"""

add_bank_incorrect_text = """
✏ Неверно указана сумма пополнения. Минимальная сумма пополнения 10 AS. Укажите количество AS , которую хотите направить в копилку.
"""

leave_bank_text = """
Укажите количество AS, которое хотите вывести из копилки в кошелек бота.

Минимальная сумма вывода: 50 AS. Комиссия за вывод нет. Вывод осуществляется в течение 14 дней.
"""

bank_leave_true_text = """
Вы уверено, что хотите вывести {} AS из копилки?
"""

bank_leave_commit_text = """
✅ Заявка на вывод создана. Ваши {} AS в течение 14 дней будут переведены на ваш основной кошелёк в боте
"""

leave_bank_not_balance_text = """
Недостаточно AS на копилке. Если у вас возникли вопросы, то свяжитесь с нами.
"""

leave_bank_incorrect_text = """
❌ Неверно указана сумма вывода

✏ Укажите количество AS, которое хотите вывести из копилки в кошелек бота.

Минимальная сумма вывода: 50 AS. Комиссия за вывод нет. Вывод осуществляется в течение 14 дней.
"""

get_text_full_pay_rub_text = """
По установленному курсу пакет {} стоит {} рублей

Перейдите по ссылке чтобы оплатить пакет
❗ Внимание, у вас есть 30 мин, после этого платеж будет не активен
"""

one_stage_partner_text = """
🎉🎉🎉

Поздравляю вы получи статус “{}”. Участвуйте в развитие сообщества, получайте новые статусы и мы наградим вас приятными бонусами

🎉🎉🎉
"""

two_stage_partner_text = """
🎉🎉🎉

Поздравляю вы получи статус “{}”. Свяжитесь с нами через саппорт для получения подарка

🎉🎉🎉
"""

three_stage_partner_text = """
🎉🎉🎉

Поздравляю вы получи статус “{}”. Мы свяжемся с вами для вручения подарка

🎉🎉🎉
"""


events_text = """
🎟 В данном разделе вы можете записаться и оплатить мероприятиями от наших экспертов. Анонсы всех мероприятий размещаются в нашем Telegram-канале и на Instagram-странице, поэтому если вы еще не подписаны, то обязательно подпишитесь:

✅ Telegram-канал <b><a href="https://t.me/+YnO5ZztkxXAyMTEy">👉 ПЕРЕЙТИ</a></b>
✅ Instagram <b><a href="https://instagram.com/asteri.club">👉 ПЕРЕЙТИ</a></b>

❗️На этот раздел действует партнерская программа. Вы получите бонус с ваших рефералов за оплату платных мероприятий и обучений.
"""

event_free_by = "Вы уверены, что хотите записаться на данное мероприятие?"

event_price_by = "Вы уверено, что хотите оплатить мероприятие?\nС вашего баланса будет списано {} AS"

leave_money_50_minimum_text = "✏ Минимальный вывод - 50 AS, попробуйте еще раз"

text_registration = """
«По вашей ссылке зарегистрировался @{}”
"""

